telespial/EdgeAI_sphere_demo_NXP_FRDM-MCXN947/src/edgeai_sand_demo.c
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include "accel4_click.h"
#include "fxls8974cf.h"
#include "par_lcd_s035.h"
#include "sw_render.h"
#include "npu/model.h"

#include "app.h"
#include "board.h"
#include "clock_config.h"
#include "fsl_clock.h"
#include "fsl_debug_console.h"
#include "fsl_lpi2c.h"
#include "pin_mux.h"

#define LCD_W 480
#define LCD_H 320

#define BALL_R 20

/* Small 3D-ish axis overlay in the bottom-left corner. */
#ifndef EDGEAI_ENV_AXES
#define EDGEAI_ENV_AXES 1
#endif

/* Empirically, the raw 12-bit output here is roughly on the order of ~512 counts per 1g
 * at the current FXLS8974 config. We use this as the full-scale tilt mapping value.
 */
#define ACCEL_MAP_DENOM 512

/* Accel axis mapping (adjust if needed). */
#ifndef EDGEAI_ACCEL_SWAP_XY
#define EDGEAI_ACCEL_SWAP_XY 1
#endif
#ifndef EDGEAI_ACCEL_INVERT_X
#define EDGEAI_ACCEL_INVERT_X 0
#endif
#ifndef EDGEAI_ACCEL_INVERT_Y
#define EDGEAI_ACCEL_INVERT_Y 0
#endif

#ifndef EDGEAI_I2C
#define EDGEAI_I2C LPI2C3
#endif

/* NPU: keep init enabled, but inference can be disabled if it blocks on a given setup. */
#ifndef EDGEAI_ENABLE_NPU_INFERENCE
#define EDGEAI_ENABLE_NPU_INFERENCE 0
#endif

/* Rendering mode:
 * - 0: "raster/flicker" mode: draw primitives directly to LCD using many small writes
 *      (visually interesting but can show tearing/shutter lines).
 * - 1: "single blit" mode: render into a RAM tile and blit once per frame
 *      (stable image, much less tearing).
 */
#ifndef EDGEAI_RENDER_SINGLE_BLIT
#define EDGEAI_RENDER_SINGLE_BLIT 0
#endif

static uint32_t edgeai_i2c_get_freq(void)
{
    return CLOCK_GetLPFlexCommClkFreq(3u);
}

static bool edgeai_i2c_write(uint8_t addr7, uint8_t reg, const uint8_t *data, uint32_t len)
{
    lpi2c_master_transfer_t xfer;
    memset(&xfer, 0, sizeof(xfer));
    xfer.slaveAddress = addr7;
    xfer.direction = kLPI2C_Write;
    xfer.subaddress = reg;
    xfer.subaddressSize = 1;
    xfer.data = (uint8_t *)data;
    xfer.dataSize = len;
    xfer.flags = kLPI2C_TransferDefaultFlag;
    return (LPI2C_MasterTransferBlocking(EDGEAI_I2C, &xfer) == kStatus_Success);
}

static bool edgeai_i2c_read(uint8_t addr7, uint8_t reg, uint8_t *data, uint32_t len)
{
    lpi2c_master_transfer_t xfer;
    memset(&xfer, 0, sizeof(xfer));
    xfer.slaveAddress = addr7;
    xfer.direction = kLPI2C_Read;
    xfer.subaddress = reg;
    xfer.subaddressSize = 1;
    xfer.data = data;
    xfer.dataSize = len;
    xfer.flags = kLPI2C_TransferDefaultFlag;
    return (LPI2C_MasterTransferBlocking(EDGEAI_I2C, &xfer) == kStatus_Success);
}

static void map_accel_xy(int32_t *ax, int32_t *ay)
{
    if (!ax || !ay) return;
#if EDGEAI_ACCEL_SWAP_XY
    int32_t tmp = *ax; *ax = *ay; *ay = tmp;
#endif
#if EDGEAI_ACCEL_INVERT_X
    *ax = -*ax;
#endif
#if EDGEAI_ACCEL_INVERT_Y
    *ay = -*ay;
#endif
}

static int32_t clamp_i32(int32_t v, int32_t lo, int32_t hi)
{
    if (v < lo) return lo;
    if (v > hi) return hi;
    return v;
}

static void dwt_cycle_counter_init(void)
{
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

static int32_t abs_i32(int32_t v) { return (v < 0) ? -v : v; }

static int32_t clamp_i32_sym(int32_t v, int32_t limit_abs)
{
    if (v > limit_abs) return limit_abs;
    if (v < -limit_abs) return -limit_abs;
    return v;
}

/* Cohen–Sutherland line clipping to a rectangle (inclusive). */
static int32_t clip_code_i32(int32_t x, int32_t y, int32_t rx0, int32_t ry0, int32_t rx1, int32_t ry1)
{
    enum { INSIDE = 0, LEFT = 1, RIGHT = 2, BOTTOM = 4, TOP = 8 };
    int32_t c = INSIDE;
    if (x < rx0) c |= LEFT;
    else if (x > rx1) c |= RIGHT;
    if (y < ry0) c |= TOP;
    else if (y > ry1) c |= BOTTOM;
    return c;
}

static bool clip_line_i32(int32_t *x0, int32_t *y0, int32_t *x1, int32_t *y1,
                          int32_t rx0, int32_t ry0, int32_t rx1, int32_t ry1)
{
    enum { INSIDE = 0, LEFT = 1, RIGHT = 2, BOTTOM = 4, TOP = 8 };
    int32_t x0v = *x0, y0v = *y0, x1v = *x1, y1v = *y1;
    int32_t c0 = clip_code_i32(x0v, y0v, rx0, ry0, rx1, ry1);
    int32_t c1 = clip_code_i32(x1v, y1v, rx0, ry0, rx1, ry1);

    while (true)
    {
        if ((c0 | c1) == 0)
        {
            *x0 = x0v; *y0 = y0v; *x1 = x1v; *y1 = y1v;
            return true;
        }
        if (c0 & c1)
        {
            return false;
        }

        int32_t out = c0 ? c0 : c1;
        int32_t x = 0, y = 0;

        if (out & TOP)
        {
            y = ry0;
            x = x0v + (int32_t)((int64_t)(x1v - x0v) * (int64_t)(y - y0v) / (int64_t)(y1v - y0v));
        }
        else if (out & BOTTOM)
        {
            y = ry1;
            x = x0v + (int32_t)((int64_t)(x1v - x0v) * (int64_t)(y - y0v) / (int64_t)(y1v - y0v));
        }
        else if (out & RIGHT)
        {
            x = rx1;
            y = y0v + (int32_t)((int64_t)(y1v - y0v) * (int64_t)(x - x0v) / (int64_t)(x1v - x0v));
        }
        else /* LEFT */
        {
            x = rx0;
            y = y0v + (int32_t)((int64_t)(y1v - y0v) * (int64_t)(x - x0v) / (int64_t)(x1v - x0v));
        }

        if (out == c0)
        {
            x0v = x;
            y0v = y;
            c0 = clip_code_i32(x0v, y0v, rx0, ry0, rx1, ry1);
        }
        else
        {
            x1v = x;
            y1v = y;
            c1 = clip_code_i32(x1v, y1v, rx0, ry0, rx1, ry1);
        }
    }
}

static void edgeai_draw_env_axes_rect(int32_t rx0, int32_t ry0, int32_t rx1, int32_t ry1)
{
#if EDGEAI_ENV_AXES
    const int32_t ox = LCD_W / 2;
    const int32_t oy = 54;
    const int32_t len = 800; /* intentionally extends off-screen */
    const uint16_t cx = 0x07FFu; /* cyan (X) */
    const uint16_t cy = 0x07E0u; /* green (Y) */
    const uint16_t cz = 0xF800u; /* red (Z) */
    /* X axis */
    {
        int32_t x0 = ox - len, y0 = oy, x1 = ox + len, y1 = oy;
        if (clip_line_i32(&x0, &y0, &x1, &y1, rx0, ry0, rx1, ry1)) par_lcd_s035_draw_line(x0, y0, x1, y1, cx);
    }
    /* Y axis */
    {
        int32_t x0 = ox, y0 = oy - len, x1 = ox, y1 = oy + len;
        if (clip_line_i32(&x0, &y0, &x1, &y1, rx0, ry0, rx1, ry1)) par_lcd_s035_draw_line(x0, y0, x1, y1, cy);
    }
    /* Z axis (diagonal down-right) */
    {
        int32_t x0 = ox - (len / 2), y0 = oy + (len / 3), x1 = ox + (len / 2), y1 = oy - (len / 3);
        if (clip_line_i32(&x0, &y0, &x1, &y1, rx0, ry0, rx1, ry1)) par_lcd_s035_draw_line(x0, y0, x1, y1, cz);
    }
#endif
}

static void edgeai_draw_env_walls_rect(int32_t rx0, int32_t ry0, int32_t rx1, int32_t ry1)
{
#if EDGEAI_ENV_AXES
    /* Simple wireframe room with vanishing point. */
    const int32_t vp_x = LCD_W / 2;
    const int32_t vp_y = 54;

    const int32_t back_w = 240;
    const int32_t back_h = 150;
    const int32_t bx0 = vp_x - back_w / 2;
    const int32_t bx1 = vp_x + back_w / 2;
    const int32_t by0 = vp_y - back_h / 2;
    const int32_t by1 = vp_y + back_h / 2;

    const int32_t fl_x0 = -200;
    const int32_t fl_x1 = LCD_W + 200;
    const int32_t fl_y  = LCD_H - 1;

    const uint16_t c_wall = 0x4208u; /* dark gray */
    const uint16_t c_floor = 0x31A6u; /* slightly brighter */

    struct seg { int32_t x0,y0,x1,y1; uint16_t c; };
    const struct seg segs[] = {
        /* Back wall rectangle */
        {bx0, by0, bx1, by0, c_wall},
        {bx1, by0, bx1, by1, c_wall},
        {bx1, by1, bx0, by1, c_wall},
        {bx0, by1, bx0, by0, c_wall},
        /* Floor edges toward vanishing point (extend off-screen) */
        {fl_x0, fl_y, vp_x, vp_y, c_floor},
        {fl_x1, fl_y, vp_x, vp_y, c_floor},
        /* Side wall edges */
        {0, fl_y, bx0, by1, c_wall},
        {LCD_W - 1, fl_y, bx1, by1, c_wall},
        /* Center "depth" line */
        {LCD_W / 2, fl_y, vp_x, vp_y, c_floor},
    };

    for (size_t i = 0; i < (sizeof(segs) / sizeof(segs[0])); i++)
    {
        int32_t x0 = segs[i].x0, y0 = segs[i].y0, x1 = segs[i].x1, y1 = segs[i].y1;
        if (!clip_line_i32(&x0, &y0, &x1, &y1, rx0, ry0, rx1, ry1)) continue;
        par_lcd_s035_draw_line(x0, y0, x1, y1, segs[i].c);
    }

    /* Axes overlay on top of walls. */
    edgeai_draw_env_axes_rect(rx0, ry0, rx1, ry1);
#else
    (void)rx0; (void)ry0; (void)rx1; (void)ry1;
#endif
}

int main(void)
{
    BOARD_InitHardware();
    dwt_cycle_counter_init();

    /* Init I2C for the accel (mikroBUS). */
    lpi2c_master_config_t masterCfg;
    LPI2C_MasterGetDefaultConfig(&masterCfg);
    masterCfg.baudRate_Hz = 400000u;
    LPI2C_MasterInit(EDGEAI_I2C, &masterCfg, edgeai_i2c_get_freq());

    fxls8974_dev_t dev = {
        .addr7 = 0,
        .write = edgeai_i2c_write,
        .read = edgeai_i2c_read,
    };

